In [43]:
import pandas as pd

In [44]:
#a series is a one-domensional array
series1 = pd.Series([10,20,30])
print(series1)

0    10
1    20
2    30
dtype: int64

In [45]:
df = pd.DataFrame({
    "Name" :  ['Esther','Tin','Nicholas','Michael'],
    "Age" : [21,25,26,28],
    "PhoneNumber" : ['65160001','65160002','65160003','65160004']
})
print(df)

       Name  Age PhoneNumber
0    Esther   21    65160001
1       Tin   25    65160002
2  Nicholas   26    65160003
3   Michael   28    65160004

In [46]:
names = [['Derek',7000],['Wendy',3000],['Nicholes',6000],['Michael',8000]]
df = pd.DataFrame(names,columns=['Name','Salary'],dtype=float)
print(df)
print(type(df))
df.describe()

       Name  Salary
0     Derek  7000.0
1     Wendy  3000.0
2  Nicholes  6000.0
3   Michael  8000.0
<class 'pandas.core.frame.DataFrame'>

            Salary
count     4.000000
mean   6000.000000
std    2160.246899
min    3000.000000
25%    5250.000000
50%    6500.000000
75%    7250.000000
max    8000.000000

In [47]:
df

       Name  Salary
0     Derek  7000.0
1     Wendy  3000.0
2  Nicholes  6000.0
3   Michael  8000.0

In [48]:
df.to_csv('Person.csv',index=False,header=True)

In [49]:
Location = "Person.csv"

In [51]:
df = pd.read_csv(Location,header=None) # read file without header
df

          0     1
0     Derek  7000
1     Wendy  3000
2  Nicholes  6000
3   Michael  8000

In [52]:
df = pd.read_csv(Location,names = ['Names','Salary'])
# read  file and specify column title
df

      Names  Salary
0     Derek    7000
1     Wendy    3000
2  Nicholes    6000
3   Michael    8000

In [54]:
max_value = df.Salary.max()
print(max_value)

df["Names"][df.Salary == max_value]

8000

3    Michael
Name: Names, dtype: object

In [56]:
df.Names
#df["Names"]

0       Derek
1       Wendy
2    Nicholes
3     Michael
Name: Names, dtype: object

In [57]:
df.dtypes

Names     object
Salary     int64
dtype: object

In [59]:
df.Salary.dtype

dtype('int64')

In [60]:
df["Salary"]

0    7000
1    3000
2    6000
3    8000
Name: Salary, dtype: int64

In [61]:
df["Salary"].mean()

6000.0

In [62]:
df["Salary"].max()

8000

In [64]:
Sorted = df.sort_values(['Salary'],ascending = False)
Sorted.head(2) # top 2 rows

     Names  Salary
3  Michael    8000
0    Derek    7000

In [65]:
col1 = [100,200]
col2 = ["M","F"]
col3 = ["Tin","Esther"]
data = {"c1":col1,
        "c2":col2,
        "c3":col3} # dictionary
df = pd.DataFrame(data)
df.columns = ["col1","col2","col3"]
df

   col1 col2    col3
0   100    M     Tin
1   200    F  Esther

In [66]:
def myfunction(x):
    if x == "M":
        return "Male"
    else:
        return "Female"
    
df["col2_full"] = df.col2.apply(myfunction)
df

   col1 col2    col3 col2_full
0   100    M     Tin      Male
1   200    F  Esther    Female

In [67]:
del df["col2_full"]
df

   col1 col2    col3
0   100    M     Tin
1   200    F  Esther

In [68]:
df['NewCol']=6
df

   col1 col2    col3  NewCol
0   100    M     Tin       6
1   200    F  Esther       6

In [69]:
df.index # index - row labels of the dataframe

RangeIndex(start=0, stop=2, step=1)

In [70]:
del df["NewCol"]
df

   col1 col2    col3
0   100    M     Tin
1   200    F  Esther

In [71]:
i = ['a','b']
df.index = i # column name of the index
df.columns = ["Credit","Gender","Name"]
df

   Credit Gender    Name
a     100      M     Tin
b     200      F  Esther

In [72]:
# iloc - integer location based indexing for selection by position
df.iloc[0]

Credit    100
Gender      M
Name      Tin
Name: a, dtype: object

In [73]:
df.iloc[0,1]

'M'

In [74]:
df.iloc[:2] # slicing -row 0 to row 1

   Credit Gender    Name
a     100      M     Tin
b     200      F  Esther

In [75]:
df.iloc[:2, :] # display evverything df.iloc[:,:]also display everything

   Credit Gender    Name
a     100      M     Tin
b     200      F  Esther

In [76]:
df.iloc[:2, 1:3] # slicing - row 0 to row 1, column 1 to 2

  Gender    Name
a      M     Tin
b      F  Esther

In [77]:
df.loc['a':'b'] # loc - access by label

   Credit Gender    Name
a     100      M     Tin
b     200      F  Esther

In [83]:
df[['Credit','Gender']]

   Credit Gender
a     100      M
b     200      F

In [80]:
df.head() # display first 5 rows

   Credit Gender    Name
a     100      M     Tin
b     200      F  Esther

In [93]:
df.iloc[:1, 1:6]

   marks level
0     70     1

In [86]:
df.tail() # last records

   Credit Gender    Name
a     100      M     Tin
b     200      F  Esther

Group By

In [87]:
students = {'age' : [10,10,11,11,11],
           'marks' : [70,80,80,90,90],
           'level' : ['1','1','2','2','3']}
df = pd.DataFrame(students)
df.head()

   age  marks level
0   10     70     1
1   10     80     1
2   11     80     2
3   11     90     2
4   11     90     3

In [88]:
letter = df.groupby('level')
letter.sum()

       age  marks
level
1       20    150
2       22    170
3       11     90

In [94]:
letter_level= df.groupby(['level','age']) # group by level, followed by age
letter_level.sum()

           marks
level age
1     10     150
2     11     170
3     11      90

In [91]:
df.nunique()

age      2
marks    3
level    3
dtype: int64